---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.RebarShape
source: html/f4ae417f-20df-e18e-79bd-6f31f835aa91.htm
---
# RebarShape Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.